python_data_model.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-03-28 Sun 21:33 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Python's Data Model</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Vaibhav Karve" />
<link rel="stylesheet" type="text/css" href="css/stylesheet.css" />
</head>
<body>
<div id="content">
<h1 class="title">Python's Data Model
<br />
<span class="subtitle"><a href="index.html">Home</a></span>
</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org282e84a">1. Objects</a>
<ul>
<li><a href="#org5364d54">1.1. Containers</a></li>
</ul>
</li>
<li><a href="#org72c1819">2. The standard type hierarchy</a></li>
</ul>
</div>
</div>
<dl class="org-dl">
<dt>Python documentation and reference on which these notes are based</dt><dd>→ <a href="https://docs.python.org/3/reference/datamodel.html">Data model</a></dd>
<dt>Python version</dt><dd>Since this note concerns a programming language, it is
important to keep track of when this note was last
updated.  These notes use v3.9.2 and were last updated
in March 2021.</dd>
</dl>


<div id="outline-container-org282e84a" class="outline-2">
<h2 id="org282e84a"><span class="section-number-2">1</span> Objects</h2>
<div class="outline-text-2" id="text-1">
<p>
<i>Objects</i> are python's abstraction of data. All data is stored as objects. All
code is also represented by objects.
</p>

<div class="org-center">
<p>
<code>Object = (Identity, Type, Value)</code>
</p>
</div>
<ol class="org-ol">
<li>The identity can be though of as an object's location in memory. <code>id()</code> gives
the identity (or memory address) of an object as an integer, while <code>is</code>
operator compares identities of two objects.</li>
<li>The type determines the operations supported by an object, as well possible
values for that object.</li>
<li>The value is the data stored-in/referenced-by an object.
<ul class="org-ul">
<li>an object is immutable if it value cannot be changed. E.g. numbers,
strings, tuples.</li>
<li>an object is mutable if it can be. E.g. dicts, lists.</li>
</ul></li>
</ol>
</div>

<div id="outline-container-org5364d54" class="outline-3">
<h3 id="org5364d54"><span class="section-number-3">1.1</span> Containers</h3>
<div class="outline-text-3" id="text-1-1">
<p>
A <i>container</i> is an object that contains references to another object.
</p>

<p>
<b>Note:</b> an immutable container of mutable objects is still considered
immutable! E.g. <code>frozenset[list[int]]</code>
</p>

<p>
The following lines are quoted directly from the documentation and are
useful, but somewhat hard to understand.
</p>
<pre class="example">
An object of an immutable sequence type cannot change once it is created. (If the object contains references to other objects, these other objects may be mutable and may be changed; however, the collection of objects directly referenced by an immutable object cannot change.)
</pre>
</div>
</div>
</div>

<div id="outline-container-org72c1819" class="outline-2">
<h2 id="org72c1819"><span class="section-number-2">2</span> The standard type hierarchy</h2>
<div class="outline-text-2" id="text-2">
<p>
In the following table, we use (⊐ A) to denote that the type A is a subtype
of the closest type listed in boldface above it. For example, the table
says that <b>Sequences</b> ⊐ list, i.e. that lists are a subtype of Sequences.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Python's standard type</th>
<th scope="col" class="org-left">Values</th>
<th scope="col" class="org-left">Isomorphic (or approximate) Lean type</th>
<th scope="col" class="org-left">Comments</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b>None</b></td>
<td class="org-left">{None}</td>
<td class="org-left">unit</td>
<td class="org-left">truthiness of None value is False.</td>
</tr>

<tr>
<td class="org-left"><b>NotImplemented</b></td>
<td class="org-left">{NotImplemented}</td>
<td class="org-left">unit</td>
<td class="org-left">value has no truthiness defined</td>
</tr>

<tr>
<td class="org-left"><b>Ellipsis</b></td>
<td class="org-left">{<code>...</code>} or {Ellipsis}</td>
<td class="org-left">unit</td>
<td class="org-left">the value of truthiness of True.</td>
</tr>

<tr>
<td class="org-left"><b>numbers.Number</b></td>
<td class="org-left">depends on subtype</td>
<td class="org-left">typeclass</td>
<td class="org-left">always immutable</td>
</tr>

<tr>
<td class="org-left">⊐ numbers.Integral</td>
<td class="org-left">depends on subtype</td>
<td class="org-left">ℤ</td>
<td class="org-left">--</td>
</tr>

<tr>
<td class="org-left">⊐⊐ int</td>
<td class="org-left">{&#x2026;, -1, 0, 1, 2, &#x2026;}</td>
<td class="org-left">ℤ (restricted by virtual memory)</td>
<td class="org-left">--</td>
</tr>

<tr>
<td class="org-left">⊐⊐ bool</td>
<td class="org-left">{False, True}</td>
<td class="org-left">bool (but subtype of ℤ)</td>
<td class="org-left">--</td>
</tr>

<tr>
<td class="org-left">⊐ numbers.Real (float)</td>
<td class="org-left">floating points</td>
<td class="org-left">restricted version of ℝ</td>
<td class="org-left">depends on computer architecture</td>
</tr>

<tr>
<td class="org-left">⊐ numbers.Complex (complex)</td>
<td class="org-left">complex floating points</td>
<td class="org-left">restricted version of ℂ</td>
<td class="org-left">depends on computer architecture</td>
</tr>

<tr>
<td class="org-left"><b>Sequences</b></td>
<td class="org-left">finite collection of ordered values indexed by ℕ</td>
<td class="org-left">array</td>
<td class="org-left">finite ordered sets indexed by ℕ</td>
</tr>

<tr>
<td class="org-left">⊐ str</td>
<td class="org-left">seq. of Unicode code points in range U+0000 to U+10FFFF</td>
<td class="org-left">string</td>
<td class="org-left">immutable</td>
</tr>

<tr>
<td class="org-left">⊐ tuple</td>
<td class="org-left">seq. of any Python objects</td>
<td class="org-left">list (but nonhomogeneous)</td>
<td class="org-left">immutable version of list</td>
</tr>

<tr>
<td class="org-left">⊐ bytes</td>
<td class="org-left">seq. of bytes formed from ASCII ints (0 to 255)</td>
<td class="org-left">--</td>
<td class="org-left">immutable version of bytearray</td>
</tr>

<tr>
<td class="org-left">⊐ list</td>
<td class="org-left">seq. of any Python objects</td>
<td class="org-left">Lean does not have mutable containers</td>
<td class="org-left">mutable version of tuple</td>
</tr>

<tr>
<td class="org-left">⊐ bytearray</td>
<td class="org-left">seq. of bytes formed from ASCII ints (0 to 255)</td>
<td class="org-left">--</td>
<td class="org-left">mutable version of bytes</td>
</tr>

<tr>
<td class="org-left"><b>Set types</b></td>
<td class="org-left">finite collection of unordered, unique values</td>
<td class="org-left">--</td>
<td class="org-left">--</td>
</tr>

<tr>
<td class="org-left">⊐ set</td>
<td class="org-left">finite set of any immutable Python objects</td>
<td class="org-left">Lean does not have mutable containers</td>
<td class="org-left">mutable version of frozenset</td>
</tr>

<tr>
<td class="org-left">⊐ frozenset</td>
<td class="org-left">finite set of any immutable Python objects</td>
<td class="org-left">finset (but nonhomogeneous)</td>
<td class="org-left">immutable version of set</td>
</tr>

<tr>
<td class="org-left"><b>Mappings</b></td>
<td class="org-left">finite collections of objects indexed by arbitrary index sets</td>
<td class="org-left">--</td>
<td class="org-left">--</td>
</tr>

<tr>
<td class="org-left">⊐ dict</td>
<td class="org-left">mappings with immutable keys</td>
<td class="org-left">alist (but nonhomogeneous and mutable)</td>
<td class="org-left">mutable</td>
</tr>

<tr>
<td class="org-left"><b>Callable types</b></td>
<td class="org-left">things that can be "called" using ()</td>
<td class="org-left">--</td>
<td class="org-left">--</td>
</tr>

<tr>
<td class="org-left">⊐ user-defined functions</td>
<td class="org-left">function with zero or more arguments</td>
<td class="org-left">function types (but possible non-exhaustive, non-terminating)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">⊐ instance methods</td>
<td class="org-left">(class, class-instance, callable-object)</td>
<td class="org-left">field of a structure's instance</td>
<td class="org-left">the class instance is <code>__self__</code>, the function instance is <code>__func__</code></td>
</tr>

<tr>
<td class="org-left">⊐ generator functions</td>
<td class="org-left">a function that uses the <code>yield</code> statement</td>
<td class="org-left">(all Lean functions are actually generators ∵ Lean is lazy)</td>
<td class="org-left">the generator returns an iterator. Calling <code>iterator.__next__()</code> executes function code.</td>
</tr>

<tr>
<td class="org-left">⊐ coroutine functions</td>
<td class="org-left">function defined using <code>async def</code></td>
<td class="org-left">--</td>
<td class="org-left">calling coroutine function returns a coroutine object.</td>
</tr>

<tr>
<td class="org-left">⊐ asynchronous generator functions</td>
<td class="org-left">function defined using <code>async def</code> and that uses <code>yield</code></td>
<td class="org-left">--</td>
<td class="org-left">calling it returns an asynchronous iterator. Calling <code>aiterator.__anext__()</code> returns an awaitable object.</td>
</tr>

<tr>
<td class="org-left">⊐ built-in functions</td>
<td class="org-left">a wrapper around a C function</td>
<td class="org-left">not distinct from function types</td>
<td class="org-left">--</td>
</tr>

<tr>
<td class="org-left">⊐ built-in methods</td>
<td class="org-left">(object, built-in-function) implemented in C</td>
<td class="org-left">not distinct from field of a structure's instance</td>
<td class="org-left">e.g. <code>[1,2,3].append(4)</code></td>
</tr>

<tr>
<td class="org-left">⊐ class</td>
<td class="org-left">factories for new class instances</td>
<td class="org-left">(I think cast/coe can be thought of as a factory. Not sure.)</td>
<td class="org-left">new instances are created by calling <code>__new__()</code> which in turn (usually) calls <code>__init__()</code>.</td>
</tr>

<tr>
<td class="org-left">⊐ class instances</td>
<td class="org-left">instances of classes (is callable sometimes)</td>
<td class="org-left">--</td>
<td class="org-left">to make an instance callable, define a <code>__call__()</code> method in its class.</td>
</tr>

<tr>
<td class="org-left"><b>Modules</b></td>
<td class="org-left">basic organizational unit of Python code</td>
<td class="org-left">--</td>
<td class="org-left">usually created by the import system using the import statement</td>
</tr>

<tr>
<td class="org-left"><b>Custom classes</b></td>
<td class="org-left">user-defined class definitions</td>
<td class="org-left">structure</td>
<td class="org-left">--</td>
</tr>

<tr>
<td class="org-left"><b>Class instances</b></td>
<td class="org-left">instance of a user-defined class</td>
<td class="org-left">term of type structure</td>
<td class="org-left">created by calling a class object</td>
</tr>

<tr>
<td class="org-left"><b>I/O objects</b> (file objects)</td>
<td class="org-left">an open file</td>
<td class="org-left">(I think this is <code>io.mode</code>)</td>
<td class="org-left">usually created by the <code>open()</code> function</td>
</tr>

<tr>
<td class="org-left"><b>Internal types</b></td>
<td class="org-left">--</td>
<td class="org-left">--</td>
<td class="org-left">this includes code objects, frame objects, traceback objects, slice objects, static method objects, and class method objects</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Vaibhav Karve</p>
<p class="date">Created: 2021-03-28 Sun 21:33</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
